In [1]:
import numpy as np
import pandas as pd

In [2]:
# 데이터 합치기와 재구성
# 멀티 인덱스
# Series의 멀티인덱스

In [3]:
# 학생 점수를 시리즈로 생성
# pd.Series(리스트)
# pd.Series(리스트, [인덱스])
# 인덱스는 단일x 멀티o
# 학년-반
# 첫번쨰 인덱스: 학년(1,2)
# 첫번쨰 인덱스: 반(A,B)
s = pd.Series([85,90,78,92,88,75],
             index=[["1학년", "1학년", "1학년", "2학년", "2학년", "2학년"],
                    ["a반", "a반", "b반", "a반", "b반", "b반"]]
             )
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

In [4]:
# 인덱스로 값 꺼내기
# 시리즈에서 1학년만 꺼내기
s['1학년']

a반    85
a반    90
b반    78
dtype: int64

In [5]:
s.index
s.loc[(('1학년', 'a반'))]

1학년  a반    85
     a반    90
dtype: int64

In [6]:
# 1학년 a반과 b반 모두 가지고 오기 (여러개 선택)
s.index
s.loc[('1학년', ['a반', 'b반'])]

1학년  a반    85
     a반    90
     b반    78
dtype: int64

In [7]:
# 1.
# 매출 데이터를 담은 Series를 만들고, 멀티 인덱스를 설정하세요
# 인덱스: 지역-지점
# 값: 매출
s = pd.Series([120,100,90,80],
             index=[['서울','서울','부산','부산'],
                    ['강남점','강북점','해운대점','서면점']]
             )
s

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [8]:
# 서울 전체 매출을 조회하세요
s.index
s['서울']

강남점    120
강북점    100
dtype: int64

In [9]:
# 부산 해운대점 매출을 조회하세요
s.index
s.loc[('부산','해운대점')]

np.int64(90)

In [10]:
# 2.
# 쇼핑몰의 판매량 데이터를 담은 Series를 만들고, 멀티 인덱스을 설정하세요
# 인덱스 : 카테고리–상품명
# 값: 판매량
s = pd.Series([300,250,500,400],
             index=[['전자제품','전자제품','식품','식품'],
                    ['노트북','휴대폰','라면','과자']]
             )
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [11]:
# 전자제품 카테고리 전체 판매량을 조회하세요
s.index
s['전자제품']

노트북    300
휴대폰    250
dtype: int64

In [12]:
# 식품 카테고리의 라면 판매량을 조회하세요
s.index
s.loc[('식품',  '라면')]

np.int64(500)

In [13]:
# 3.
# 도서관의 대출 건수를 담은 Series를 만들고 멀티 인덱스를 설정하세요
# 인덱스: 학년–과목
# 값: 대출 건수
s = pd.Series([40,35,50,45],
             index=[['1학년','1학년','2학년','2학년'],
                    ['국어','수학','국어','수학']]
             )
s

1학년  국어    40
     수학    35
2학년  국어    50
     수학    45
dtype: int64

In [14]:
# 1학년 전체 대출 건수를 조회하세요
s.index
s['1학년']

국어    40
수학    35
dtype: int64

In [17]:
# 2학년 수학 과목의 대출 건수를 조회하세요
s.index
s.loc[('2학년', '수학')]

np.int64(45)

In [21]:
# 데이터 프레임의 멀티 인덱스
# 상품 판매 데이터를 데이터프레임으로 생성
# pd.DataFrame(2차원배열데이터)
# pd.DataFrame(데이터,[인덱스],[컬럼])
# 데이터: 판매량
# 행 인덱스: 멀티(연도-지점)
# 열 컬럼: 제품
df = pd.DataFrame([[50,60],[70,80],[100,110],[120,130]],
                  index=[["2020년","2020년","2021년","2021년"],
                         ["구월점","부평점","구월점","부평점"]],
                  columns=["제품1","제품2"]
                 )
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

In [23]:
# 데이터프레임에서 데이터 꺼내기
# 2020년도 전체 판매량 조회
print(df.index) # 행
print(df.columns) # 열

MultiIndex([('2020년', '구월점'),
            ('2020년', '부평점'),
            ('2021년', '구월점'),
            ('2021년', '부평점')],
           )
Index(['제품1', '제품2'], dtype='object')

In [24]:
df.loc['2020년']

     제품1  제품2
구월점   50   60
부평점   70   80

In [27]:
# 2020년 구월점 판매량만 조회
df.loc[('2020년', '구월점')]

제품1    50
제품2    60
Name: (2020년, 구월점), dtype: int64

In [28]:
# 2021년 부평점의 제품2 판매량만 조회
df.loc[('2021년', '부평점'), '제품2']

np.int64(130)

In [30]:
# 1.
# 도서관 대출 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
# 행 인덱스: 도서관–월
# 열: 소설, 과학
# 값: 대출 건수
df = pd.DataFrame([[120,45],[95,60],[150,70],[110,55]],
                  index=[["중앙도서관", "중앙도서관", "시립도서관", "시립도서관"],
                         ["1월", "2월", "1월", "2월"]],
                  columns=["소설", "과학"]
                 )
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [31]:
# 중앙도서관 전체 대출 건수를 조회하세요
df.loc[("중앙도서관")]

     소설  과학
1월  120  45
2월   95  60

In [32]:
# 시립도서관 2월의 과학 대출 건수를 조회하세요
df.loc[("시립도서관",'2월'),'과학']

np.int64(55)

In [35]:
# 2.
# 자동차 판매량 데이터를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
# 행 인덱스: 연도–차종
# 열: 1분기, 2분기
# 값: 판매 대수
df = pd.DataFrame([[320,280],[210,230],[400,390],[180,200]],
                  index=[['2022년','2022년','2023년','2023년'],
                        ['SUV','세단','SUV','세단']],
                  columns=['1분기','2분기']                 
                 )
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [36]:
# 2022년 전체 판매량을 조회하세요
df.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [37]:
# 2023년 세단의 2분기 판매량을 조회하세요
df.loc[('2023년','세단'),'2분기']

np.int64(200)

In [38]:
# 3.
# 호텔 예약 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
# 행 인덱스: 지점–월
# 열: 싱글룸, 더블룸
# 값: 예약 건수
df = pd.DataFrame([[45,30],[50,35],[60,40],[55,38]],
                 index=[['서울지점','서울지점','부산지점','부산지점'],
                        ['7월','8월','7월','8월']],
                 columns=['싱글룸','더블룸']
                 )
df

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [39]:
# 서울지점 전체 예약 건수를 조회하세요
df.loc['서울지점']

    싱글룸  더블룸
7월   45   30
8월   50   35

In [40]:
# 부산지점 8월의 더블룸 예약 건수를 조회하세요
df.loc[('부산지점','8월'),'더블룸']

np.int64(38)

In [41]:
# 4.
# 쇼핑몰 주문 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
# 행 인덱스: 카테고리–상품
# 열: 1월, 2월
# 값: 주문 건수
df = pd.DataFrame([[120,140],[80,95],[200,230],[150,160]],
                 index=[['가전','가전','식품','식품'],
                        ['노트북','청소기','라면','과자']],
                 columns=['1월','2월']
                 )
df

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  230
   과자   150  160

In [42]:
# 가전 카테고리 전체 주문 건수를 조회하세요
df.loc['가전']

      1월   2월
노트북  120  140
청소기   80   95

In [43]:
# 식품 카테고리 라면의 2월 주문 건수를 조회하세요
df.loc[('식품','라면'),'2월']

np.int64(230)

In [44]:
# 데이터 합치기 - merge
# 학생 데이터를 담아서 데이터프레임 생성
df1 = pd.DataFrame({
                    '학번':[1,2,3], 
                    '이름':['철수','영희','민수']}
                  )
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [45]:
# 시험 점수 데이터를 담아서 데이터프레임 생성
df2 = pd.DataFrame({
                    '학번':[1,2,4], 
                    '점수':[90,85,70]}
                  )
df2

   학번  점수
0   1  90
1   2  85
2   4  70

In [46]:
# 학생정보와 시험점수 합치기
pd.merge(df1, df2, on='학번') # on -> 공통컬럼

   학번  이름  점수
0   1  철수  90
1   2  영희  85

In [47]:
pd.merge(df1, df2, on='학번', how="left")

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [48]:
pd.merge(df1, df2, on='학번', how="right")

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [49]:
pd.merge(df1, df2, on='학번', how="outer")

   학번   이름    점수
0   1   철수  90.0
1   2   영희  85.0
2   3   민수   NaN
3   4  NaN  70.0

In [54]:
# 1.
# 고객 데이터를 담은 DataFrame와 주문 데이터를 담은 DataFrame를 만들고,
# 고객ID 기준으로 합치세요
# → 결과를 보고 어떤 join 방식을 쓸지 결정하세요

df1 = pd.DataFrame({
    "고객ID": [101, 102, 103],
    "이름": ["철수", "영희", "민수"]
})

# 주문 데이터
df2 = pd.DataFrame({
    "고객ID": [101, 104, 102],
    "상품": ["노트북", "청소기", "책"]
})
df2

# 두 데이터 합치기 (공통 컬럼은 고객ID)
# 공통된 고객만 가져오기 (inner join)
# pd.merge(df1, df2, on="고객ID")

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [53]:
pd.merge(df1, df2, on='고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [ ]:
# 여러개의 데이터를 이어붙이는 함수 concat

In [61]:
df1 = pd.DataFrame({'학번':[1,2,3], '이름':['철수','영희','민수']})
df2 = pd.DataFrame({'학번':[1,2,4], '점수':[90,85,70]})

In [69]:
# 두 데이터 이어 붙이기
# 방향: 기본값 axis=0 (y축 위아래)
pd.concat([df1, df2], axis=1)

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   3  민수   4  70

In [67]:
pd.concat([df1, df2], ignore_index=True)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
3   1  NaN  90.0
4   2  NaN  85.0
5   4  NaN  70.0

In [75]:
# 1.
# 사원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들고, 하나로 합치세요
# → 결과를 보고 어떤 방향을 쓸지 결정하세요
df1 = pd.DataFrame({'사번':[1,2], '이름':['홍길동','임꺽정']})
df2 = pd.DataFrame({'부서':['영업','개발']})
df2

pd.concat([df1,df2], axis=1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [82]:
# 2.
# 세 개의 매출 데이터 DataFrame를 만들고, 하나로 합치세요
# → 결과를 보고 어떤 옵션(방향, 인덱스)을 쓸지 결정하세요
df1 = pd.DataFrame({"매출": [100, 200]})
df2 = pd.DataFrame({"매출": [150, 250]})
df3 = pd.DataFrame({"매출": [300, 400]})
df3

pd.concat([df1,df2,df3], axis=0, ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [ ]:
# 데이터 재구성 pivot

In [83]:
df = pd.DataFrame({
    "이름": ["철수", "영희", "철수", "영희"],
    "과목": ["국어", "국어", "수학", "수학"],
    "점수": [90, 85, 80, 95]
})
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [87]:
# 성적표 형태로 변경
result = df.pivot(index='이름', columns='과목', values='점수')
result

과목  국어  수학
이름
영희  85  95
철수  90  80

In [89]:
# 1.
# 쇼핑몰 판매 데이터를 담은 DataFrame를 만들고,
# pivot을 이용해 카테고리별 월 매출을 출력하세요
df = pd.DataFrame({
    '카테고리':['식품','식품','가전','가전'],
    '월':['1월','2월','1월','2월'],
    '매출':[200,250,500,550]
})
df

  카테고리   월   매출
0   식품  1월  200
1   식품  2월  250
2   가전  1월  500
3   가전  2월  550

In [90]:
df.pivot(index='카테고리', columns='월', values='매출')

월      1월   2월
카테고리
가전    500  550
식품    200  250